Revit 2027 API
ParameterTypeId.ViewShowHiddenLines Property
 "Show Hidden Lines"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewShowHiddenLines { get; }
Public Shared ReadOnly Property ViewShowHiddenLines As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewShowHiddenLines {
	ForgeTypeId^ get ();
}
static member ViewShowHiddenLines : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace